In [2]:
#Standard imports

import pandas as pd

In [3]:
#Refernce paths for data files

file1 = '/Users/gta/dev/hw-4/schools_complete.csv'
file2 = '/Users/gta/dev/hw-4/students_complete.csv'

In [4]:
#Read in csv file into two dataframes

df_schools = pd.read_csv(file1)
df_students = pd.read_csv(file2)

In [5]:
#Display head of df_schools

df_schools.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
#Display shape of df_schools

df_schools.shape

(15, 5)

In [7]:
df_schools.describe()

       School ID         size        budget
count  15.000000    15.000000  1.500000e+01
mean    7.000000  2611.333333  1.643295e+06
std     4.472136  1420.915282  9.347763e+05
min     0.000000   427.000000  2.480870e+05
25%     3.500000  1698.000000  1.046265e+06
50%     7.000000  2283.000000  1.319574e+06
75%    10.500000  3474.000000  2.228999e+06
max    14.000000  4976.000000  3.124928e+06

In [8]:
#Display head of df_students

df_students.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [9]:
#Display shape of df_students

df_students.shape

(39170, 7)

In [10]:
df_students.describe()

         Student ID  reading_score    math_score
count  39170.000000    39170.00000  39170.000000
mean   19584.500000       81.87784     78.985371
std    11307.549359       10.23958     12.309968
min        0.000000       63.00000     55.000000
25%     9792.250000       73.00000     69.000000
50%    19584.500000       82.00000     79.000000
75%    29376.750000       91.00000     89.000000
max    39169.000000       99.00000     99.000000

### District Summary

Create a high level snapshot (in table form) of the district's key metrics, including:

+ ~~Total Schools~~
+ ~~Total Students~~
+ ~~Total Budget~~
+ ~~Average Math Score~~
+ ~~Average Reading Score~~
+ ~~% Passing Math~~
+ ~~% Passing Reading~~
+ ~~Overall Passing Rate (Average of the above two)~~

In [11]:
#Total Schools

total_schools = len(df_schools['name'])
total_schools

15

In [12]:
total_students = sum(df_schools['size'])
total_students

39170

In [13]:
total_budget = sum(df_schools['budget'])
total_budget

24649428

In [20]:
average_math_score = df_students['math_score'].mean()
average_math_score

78.98537145774827

In [21]:
average_reading_score = df_students['reading_score'].mean()
average_reading_score

81.87784018381414

In [30]:
#Determine percent of students with a passing math score (assume that a passing math score is >69)
total_students_with_passing_math_score = len(df_students.loc[df_students['math_score'] > 69])
total_students_with_passing_math_score

29370

In [34]:
pct_passing_math_score = 100 * (total_students_with_passing_math_score / total_students)
pct_passing_math_score

74.980852693387803

In [39]:
#Determine percent of students with a passing reading score (assume that a passing reading score is >69)

total_students_with_passing_reading_score = len(df_students.loc[df_students['reading_score'] > 69])
total_students_with_passing_reading_score

33610

In [35]:
pct_passing_reading_score = 100 * (total_students_with_passing_reading_score / total_students)
pct_passing_reading_score

85.805463364820014

In [38]:
overall_pct_passing = (pct_passing_math_score + pct_passing_reading_score) / 2
overall_pct_passing

80.393158029103915

### School Summary

Create an overview table that summarizes key metrics about each school, including:

+ School Name
+ School Type
+ Total Students
+ Total School Budget
+ Per School Budget
+ Average Math Score
+ Average Reading Score
+ % Passing Math
+ % Passing Reading
+ Overall Passing Rate (Average of the above two)